Repository: coteditor/CotEditor
Catalog: CotEditor/Localizables/RegexReference.xcstrings
Source language: en
Languages: cs, de, es, fr, it, ja, nl, pt, tr, zh_hans, zh_hant

source: 0 or more times
cs: Žádný nebo více
de: null- oder mehrmals
es: 0 o más veces
fr: 0 fois ou plus
it: Zero o più volte
ja: 0回以上
nl: 0 of meerdere keren
pt: 0 ou mais vezes
tr: 0 veya daha çok kez
zh_hans: 0次或更多
zh_hant: 0次或更多

source: 1 or 0 times
cs: Žádný nebo jeden
de: null- oder einmal
es: 1 o 0 veces
fr: 1 fois ou 0
it: Una o zero volte
ja: 1回または0回
nl: 1 of 0 keer
pt: 1 ou 0 vez
tr: 1 veya 0 kez
zh_hans: 1次或0次
zh_hant: 1次或0次

source: 1 or more times
cs: Jeden nebo více
de: einmal oder mehrmals
es: 1 o más veces
fr: 1 fois ou plus
it: Una o più volte
ja: 1回以上
nl: 1 of meerdere keren
pt: 1 ou mais vezes
tr: 1 veya daha çok kez
zh_hans: 1次或更多
zh_hant: 1次或更多

source: Anchors
cs: Kotvy
de: Anker
es: Anclas
fr: Ancrages
it: Ancore
ja: アンカー
nl: Ankers
pt: Âncoras
tr: Çapalar
zh_hans: 锚点
zh_hant: 錨點

source: any character
cs: Jakýkoli znak
de: beliebiges Zeichen
es: Cualquier carácter
fr: N’importe quel caractère
it: Qualsiasi carattere
ja: 任意の1文字
nl: elk teken
pt: qualquer caractere
tr: herhangi bir karakter
zh_hans: 任意字符
zh_hant: 任意字元

source: any character in range A to Z
cs: Libovolný znak v rozsahu A až Z
de: irgendein Zeichen im Bereich A bis Z
es: Cualquier carácter en el rango de A a Z
fr: Caractère entre A et Z
it: Qualsiasi carattere dalla A alla Z
ja: AからZの中の任意の1文字
nl: elk teken in bereik van A tot Z
pt: qualquer caractere entre A e Z
tr: A-Z erimindeki herhangi bir karakter
zh_hans: A到Z范围内的任意字符
zh_hant: A到Z範圍內的任意字元

source: any character not in range A to Z
cs: Libovolný znak mimo rozsah A až Z
de: irgendein Zeichen nicht im Bereich A bis Z
es: Cualquier carácter que no entre en el rango de A a Z
fr: Tout sauf un caractère entre A et Z
it: Qualsiasi carattere non nell’intervallo A-Z
ja: AからZ以外の任意の1文字
nl: elk teken buiten bereik van A tot Z
pt: qualquer caractere fora de A a Z
tr: A-Z eriminde bulunmayan herhangi bir karakter
zh_hans: 不在A到Z范围内的任意字符
zh_hant: 不在A到Z範圍內的任意字元

source: at least 0 but not more than n times
cs: Alespoň 0, ale ne více než n krát
de: mindestens nullmal und maximal n-mal
es: Al menos 0 pero no más de n veces
fr: Au moins 0 fois mais plus de n fois
it: Almeno 0 volte ma non più di n volte
ja: 0回以上n回以下
nl: minstens 0 maar niet meer dan n keer
pt: ao menos 0, mas não mais que n vezes
tr: en az 0; ancak n’den fazla değil
zh_hans: 至少0次但不超过n次
zh_hant: 至少0次但不超過n次

source: at least n but not more than m times
cs: Alespoň n krát, ale ne více než m krát
de: mindestens n-mal und maximal m-mal
es: Al menos n, pero no más de m veces
fr: Au moins n mais pas plus de m fois
it: Almeno n volte ma non più di m volte
ja: n回以上m回以下
nl: minstens n maar niet meer dan m keer
pt: ao menos n, mas não mais que m vezes
tr: en az n; ancak m’den fazla değil
zh_hans: 至少n次但不超过m次
zh_hant: 至少n次但不超過m次

source: at least n times
cs: Alespoň n krát
de: mindestens n-mal
es: Al menos n veces
fr: Au moins n fois
it: Almeno n volte
ja: n回以上
nl: minstens n keer
pt: ao menos n vezes
tr: en az n kez
zh_hans: 至少n次
zh_hant: 至少n次

source: Back Reference
cs: Zpětný odkaz
de: Rückwärtsreferenz
es: Referencia posterior
fr: Références passées
ja: 後方参照
nl: Terugverwijzing
pt: Referência Inversa
tr: Geri Başvuru
zh_hans: 回溯引用
zh_hant: 回溯引用

source: Basic Regular Expression Syntax
cs: Základní syntaxe regulárního výrazu
de: Grundlegende Grammatik regulärer Ausdrücke
es: Sintaxis básica de la expresión regular
fr: Syntaxe de base des expressions régulières
it: Sintassi di un’espressione regolare di base
ja: 正規表現の基本文法
nl: Standaard syntaxis van reguliere expressies
pt: Sintaxe Básica de Expressões Regulares
tr: Yalın Düzenli İfade Sözdizimi
zh_hans: 基本正则表达式语法
zh_hant: 基本常規表示式文法

source: beginning of the line
cs: Začátek řádku
de: Anfang der Zeile
es: Comienzo de la línea
fr: Début de la ligne
it: Inizio riga
ja: 行頭
nl: begin van de regel
pt: início da linha
tr: satır başlangıcı
zh_hans: 行首
zh_hant: 行首

source: Characters
cs: Znaky
de: Zeichen
es: Caracteres
fr: Caractères
it: Caratteri
ja: 文字
nl: Tekens
pt: Caracteres
tr: Karakterler
zh_hans: 字符
zh_hant: 字元

source: decimal number
cs: Číslice
de: Ziffer
es: Número decimal
fr: Chiffre
it: Decimale
ja: 10進数字
nl: decimaal getal
pt: número decimal
tr: onluk sayı
zh_hans: 数字
zh_hant: 數字

source: end of the line
cs: Konec řádku
de: Ende der Zeile
es: Final de la línea
fr: Fin de la ligne
it: Fine riga
ja: 行末
nl: einde van de regel
pt: final da linha
tr: satır sonu
zh_hans: 行末
zh_hant: 行末

source: Extended Groups
cs: Rozšířené skupiny
de: Erweiterte Gruppen
es: Grupos extendidos
fr: Groupes étendus
it: Gruppi estesi
ja: 拡張グループ
nl: Uitgebreide groepen
pt: Grupos Ampliados
tr: Genişletilmiş Gruplar
zh_hans: 扩展分组
zh_hant: 擴展分組

source: first match
cs: První shoda
de: erste Übereinstimmung
es: Primer coincidencia
fr: Première correspondance
it: primo risultato
ja: 最初の一致
nl: eerste overeenkomst
pt: primeira ocorrência
tr: ilk eşleşme
zh_hans: 首字匹配
zh_hant: 首字匹配

source: ICU Regular Expressions
cs: Regulární výrazy ICU
de: reguläre Ausdrücke von ICU
es: Expresiones regulares ICU
ja: ICU正規表現
nl: ICU reguliere expressie
zh_hans: ICU正则表达式

source: n times
cs: n krát
de: n-mal
es: n veces
fr: n fois
it: n volte
ja: n回
nl: n keer
pt: n vezes
tr: n kez
zh_hans: n次
zh_hant: n次

source: new line character
cs: Odřádkování
de: Zeilenende (New Line)
es: Carácter de nueva línea
fr: Nouvelle ligne
it: Carattere a capo (nuova riga)
ja: 改行
nl: nieuwe regel
pt: caractere de nova linha
tr: yeni satır karakteri
zh_hans: 换行符
zh_hant: 換行符

source: non-whitespace character
cs: Znak nepředstavující mezeru
de: kein Leerzeichen
es: Carácter no espacios en blanco
fr: Pas un espace
it: Carattere non spazio bianco
ja: 非空白文字
nl: teken zonder witruimte
pt: caractere de espaço não em branco
tr: boşluk olmayan karakter
zh_hans: 非空格字符
zh_hant: 非空格字元

source: Quantifiers
cs: Kvantifikátor
de: Quantoren
es: Cuantificadores
fr: Quantificateurs
it: Quantificatore
ja: 量指定子
nl: Factoren
pt: Quantificadores
tr: Niceleyiciler
zh_hans: 数量
zh_hant: 數量

source: tab character
cs: Tabulátor
de: Tabulator-Zeichen
es: Carácter tabulación
fr: Tabulation
it: Carattere Tabulazione
ja: 水平タブ
nl: tab-teken
pt: caractere de tabulação
tr: sekme karakteri
zh_hans: 制表符
zh_hant: 定位符號

source: The syntax conforms to the %@ specifications.
cs: Syntaxe odpovídá specifikacím %@.
de: Die Syntax entspricht den Spezifikationen von der %@.
es: La sintaxis se ajusta a las %@ especificaciones.
fr: Syntaxe conforme aux spécifications %@.
it: La sintassi rispetta le specifiche %@
ja: 文法は%@の仕様に準拠しています。
nl: De syntaxis voldoet aan de %@ specificaties.
pt: A sintaxe está em conformidade com as especificações %@.
tr: Sözdizim, %@ belirtimine uyar.
zh_hans: 语法遵守%@规范
zh_hant: 該文法遵循「%@」引擎之規範。

source: whitespace character
cs: Mezera
de: Leerzeichen
es: Carácter de espacio en blanco
fr: Espace
it: Carattere spazio bianco
ja: 空白文字
nl: teken met witruimte
pt: caractere de espaço em branco
tr: boşluk karakteri
zh_hans: 空格字符
zh_hant: 空格字元

source: word boundary
cs: Hranice slova
de: Wortgrenze
es: Límites de las palabras
fr: Début ou fin de mot
it: Limiti delle parole
ja: 非単語境界
nl: woordgrens
pt: limite da palavra
tr: sözcük sınırı
zh_hans: 单词边界
zh_hant: 單字邊界

source: word character
cs: Výraz
de: Buchstabe
es: Carácter de la palabra
fr: Mot
it: Carattere parola
ja: 単語構成文字
nl: woordteken
pt: caractere de palavra
tr: sözcük karakteri
zh_hans: 单词字符
zh_hant: 單字字元

source: look-ahead
es: Mirar hacia adelante
fr: Test avant
it: guarda avanti
ja: 先読み
nl: kijk vooruit
tr: öne bak
zh_hans: 前向
zh_hant: 前向

source: look-behind
es: Mirar hacia atrás
fr: Test arrière
it: guarda indietro
ja: 戻り読み
nl: kijk achterom
tr: arkaya bak
zh_hans: 后向
zh_hant: 後向
